app/controllers/tasks_controller.rb

  def index
    @tasks = current_user.tasks.order(created_at: :desc)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? ORDER BY "tasks"."created_at" DESC  [["user_id", 1]]

  def create
    @task = current_user.tasks.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "qqq"], ["description", "qqq"], ["created_at", "2020-11-24 10:09:10.804531"], ["updated_at", "2020-11-24 10:09:10.804531"], ["user_id", 1]]

  def show
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 8], ["LIMIT", 1]]

  def edit
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 5], ["LIMIT", 1]]

  def update
    @task = current_user.tasks.find(params[:id])
    @task.update!(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "jjj\r\nhttps://teratail.com/questions/141441"], ["updated_at", "2020-11-24 10:18:10.910824"], ["id", 5]]

  def destroy
    @task = current_user.tasks.find(params[:id])
    @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 5], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 8], ["LIMIT", 1]]